[
    "Description of Work Assistant District Attorney description imageSALARY GRADE:  Flat Rated The Office of the District Attorney, Prosecutorial District 15, seeks a qualified attorney to prosecute criminal cases. Duties include but are not limited to the following: screen incoming cases using logic and reasoning to identify the strengths and weaknesses of case facts; research and identify precedence in case law; utilize and evaluate electronic legal research and other research tools; prepare cases for trial; write and file any appropriate motions; organize work; set priorities; meet critical deadlines; follow up on assignments; and meet with victims of crime. Caseload may include district and superior court cases. Knowledge, Skills and Abilities / Competencies Knowledge of: federal, state, common, and constitutional law; judicial procedures and rules of evidence; case, statutory, and common law; NC General Statutes to prosecute criminal cases; judicial and quasi-judicial procedures; legal research methods, techniques, sources, databases, and other research tools; the principles and protocols for the evidentiary gathering of information, documents, financial records, and other data that may be used in trial court processes, protocols, and strategies; the operations of the NC court system; and ethical and professional standards of conduct. Skill in: interpreting and applying complex criminal laws to information, evidence, and other data; listening techniques used in interviewing witnesses; using logic and reasoning to identify the strengths and weaknesses of case facts; researching and identifying precedence in case law; utilizing and evaluating electronic legal research and online systems; negotiating plea agreements; organizing work; setting priorities; meeting critical deadlines; and following up on assignments with a minimum of direction. Ability to: analyze facts, laws, rules, regulations, interpretations, and related written documents and apply applicable law to those facts; conduct legal research; plan, develop, and execute an effective litigation strategy to achieve desired results; prepare, organize, and conduct witness examinations; deliver opening statements, closing arguments, and evidentiary objections; express complex legal concepts and related facts in a clear and concise manner; argue clearly, logically, and persuasively; establish and maintain cooperative working relationships with attorneys, law enforcement agencies, and other participants in the criminal justice process; recognize and solve problems; produce legal interpretations in a quick and responsive manner for court officials; write reports, motions, briefs, and other legal documents; deal tactfully with sensitive situations; communicate both orally and in writing; and work independently. Minimum Education and Experience Requirements Juris Doctor degree from an ABA accredited law school and an active license to practice law in North Carolina. Attach cover letter and résumé. Supplemental and Contact Information INSTRUCTIONS: Applicants must complete an on-line application by clicking the above APPLY link. Mailed or faxed applications will not be accepted. Before applying, please read the Online Employment Application Guide for instructions on creating your profile and applying for specific postings. It is important your application includes all of your relevant education and work experience and that you answer all questions associated with the application to receive proper credit. Résumés are not accepted in lieu of fully completed applications. *NOTE* Many job postings require certain documents be attached to an application. Verify your application is complete and uploaded documents are attached to your application before submitting it. Applications may not be altered after they have been submitted. Carefully review the FAQs if you experience difficulty with the application process or attaching documents. For technical issues with applications or attachments, call the NeoGov Help Line at 855-524-5627. Assistant District Attorney description image All NC Judicial Branch agencies are Equal Opportunity Employers. The North Carolina Judicial Branch participates in E-Verify, an internet-based system that compares information from an employee's Form I-9, Employment Eligibility Verification, to data from the US Department of Homeland Security and Social Security Administration records to confirm employment eligibility. To learn more, click on these links: E-Verify  (Download PDF reader)Participation (Download PDF reader) E-Verify (Download PDF reader) Participation (Spanish) (Download PDF reader) Right to  (Download PDF reader)Work (Download PDF reader) Right (Download PDF reader) to Work (Spanish) (Download PDF reader) Charmaine J. Leeks NC Administrative Office of the Courts Human Resources Division https://www.nccourts.gov/about/about-judicial-branch/careers",
    "Description of Work If you are looking for a rewarding career in education, please consider serving as an Interventionist in our Youth School at North Carolina Correctional Institution for Women. This position will be a main point of contact providing support and instruction in core academic areas to students in pursuit of attaining a high school equivalency diploma. Because this work requires flexibility and investment, candidates with top instructional skills and a strong work ethic will find greatest success and opportunity. This position is located within the academic school at North Carolina Correctional Institution for Women (NNCIW), Raleigh, NC (Wake County). Reporting to the School Principal, the Interventionist will serve as a core member of the academic team in fulfilling and monitoring the school’s vision, mission, core values, and goals, and should be competent at organizing and delivering education curricula to groups of student offenders of all ages in effective ways to create a flexible program and environment favorable to learning and personal growth in accordance with the ability of each student offender housed in a female correctional facility as well as completing or performing any additional duties as assigned by the principal. The purpose of this position is to teach content focused on increasing basic skills in core reading, writing, grammar, and mathematics areas through individual, small group, and whole class instruction as well as providing targeted remediation and enrichment as needed. The intent of this position is to provide direct remedial instruction to offenders aged 18 to 22 for the purpose of attaining a high school equivalency diploma. Job responsibilities of this position include, but are not limited to, the following: Designing lessons and instructional materials based on instructional best practices with clear learning targets and measurable goals aligned with Common Core, College and Career Readiness (CCRS), and NC state standards and suitable for verbal and/or visual instruction of students with a wide range of mental, physical, and emotional maturity and functioning at a wide range of academic levels. Providing direct group and individual instruction, based on assessment of student progress through the use of formative and summative data collection, designed to meet individual needs, motivate active and appropriate student participation, achieve academic goals, and help students make successful transitions within the academic school, the prison system, and back into society. Establishing and maintaining standards of student conduct required to achieve effective participation in all activities and which support the accepted school-wide behavior plan. Collaborating with fellow teachers and other school personnel regarding students on specific caseload as well as best instructional practices. This is a full-time, permanent and continuing position (40 hours per week) with State Benefits. This is a year-round position. Compensation for all certified educators working for NCDAC in school educator positions is based on the NC Department of Public Instruction’s Salary Schedule. This schedule is approved annually by the NC General Assembly and sets pay based on the educator's years of experience and education level. About the Department of Adult Correction (DAC) The North Carolina Department of Adult Correction is responsible for the care, custody, and supervision of all adults sentenced after conviction for violating North Carolina laws. This department includes State Prisons, Correction Enterprises, the Division of Community Supervision, and the Division of Rehabilitation & Reentry. ABOUT NCCIW – Located in Raleigh, NC (Wake County), the North Carolina Correctional Institution for Women is the state's primary correctional facility for women. It houses the largest offender population in the state and serves as the support facility for the state's other female prisons. The campus-style facility sits on 30 acres of a 190-acre tract of state land and houses up to 1,700 offenders of all custody (minimum/medium/ close) levels. In addition to providing the primary medical, mental, and alcohol and chemical dependency treatment for female offenders, NCCIW offers a wide variety of programs, including educational and vocational programs, as well as a variety of job assignments; this facility is home to one of the prison system's four schools for younger offenders. Knowledge, Skills and Abilities / Competencies Effective July 1, 2025, candidates now meet the minimum qualifications of a position if they have the minimum education and experience listed from the class specification. The knowledge, skills, and abilities listed in the vacancy announcement should be used as management preferences and be used to screen for the most qualified pool of applicants. Management Preferences: Preference will be given to a candidate who shows evidence of: Documented ability to provide effective remedial instruction in reading, writing, grammar, and mathematics at a variety of levels through the use of a variety of instructional strategies Documented ability to manage classroom behavior and maintain an orderly classroom through the use of behavioral management techniques Documented ability to utilize data gathered through formative and summative classroom assessments, both formal and informal in nature, to identify, diagnose, evaluate, and assess learning needs of individual students Documented ability to write education plans for students, both as groups and individually Documented experience in maintaining complete and accurate records and developing meaningful reports from that information to provide to appropriate stakeholders. Certification in multiple subject areas (such as math and science) Experience in a variety of educational practices for at-risk students Experience in preparing lessons aligned to and informed by College and Career Ready Standards, Common Core Standards, and the NC Standard Course of Study designed to meet student needs Experience in teaching knowledge and skills associated with reading, writing, grammar, and mathematics content to students at a variety of academic performance levels Experience in utilizing a variety of instructional methods that align with best practices as well as with student needs Experience in developing, implementing, and communicating a classroom management plan designed to address diverse student behaviors as well as to provide necessary supports used to assist students when academic and behavioral problems arise Experience in maintaining accurate records including, but not limited to, attendance, grades, summative and formative performance, assessment results, and anecdotal notes Experience in aggregating, disaggregating, and interpreting standardized tests, formative and summative assessment results, and student data accurately and effectively Experience in communicating effectively with all pertinent stakeholders, in both oral and written formats, and in working cooperatively with colleagues while serving as a positive force supportive of the school’s culture Experience in the use of technology-based productivity applications and software programs including, but not limited to, applications within the Microsoft Office Suite (Word, Excel, etc.) Experience in being flexible in expectations as well as in classroom instructional plans in an ever-changing environment Support of knowledge, skills, and abilities, as well as any management preferences, should be demonstrated on the application, in the education, in the work experience, and in the answers to supplemental questions. Minimum Education and Experience Requirements NOTE:  Some state job postings say you can qualify by an “equivalent combination of education and experience.” If that language appears below, then you may qualify through EITHER years of education OR years of directly related experience, OR a combination of both. See oshr.nc.gov/experience-guide for detail. The successful applicant must possess a bachelor’s degree or above (from an appropriately accredited college) in the teaching area associated with this position and must hold a current (non-expired) State of North Carolina Professional Educator’s License (Class Code A, M, S, or D) with certification in the area of reading, English/ language arts, or mathematics at the elementary or middle school level, OR certification 25881 EC - General Curriculum (grades K-6) or in an area of Exceptional Children (license codes 88***), including, but not limited to, EC English, EC Math, Cross Categorical, Learning Disabled, or Special Education: General Curriculum or be eligible to obtain an Emergency or Residency teaching license or Provisional Certification in the aforementioned certification area(s). This must be indicated in and attached to your application. Eligibility requirements for the Emergency and Residency Licenses are: Emergency One-Year License Eligibility: the candidate must (1) hold a bachelor's degree with 18 hours of coursework relevant to the requested licensure area (but has not completed a recognized educator preparation program) and (2) does not qualify for a Residency License Residency License Eligibility: the candidate must (1) hold a bachelor's degree from an accredited college/university; (2) have completed 24 hours of coursework relevant to the requested area of licensure OR passed the content area examination relevant to the requested licensure area that has been approved by the State Board of Education; (3) be enrolled in a recognized Educator Preparation Program (EPP). This position is governed under Chapter 115c, Elementary and Secondary Education, and Chapter 126 of the NC State Human Resources Act. This position is funded through annual Title I grant funds. In addition to the listed knowledge, skills, and abilities, applicants must also demonstrate that the minimum education and experience requirements have been met. Supplemental and Contact Information 20250625104551_NCDAC and ALL IN Logo Picture.jpg Come Join Us To Make A Difference! Department of Adult Correction is one of the largest state agencies with more than 19,000 employees. It is responsible for safeguarding and preserving the lives and property of its citizens through prevention, protection, and preparation as well as the care, custody, and supervision of all adults sentenced after conviction for violating North Carolina laws. This department includes State Prisons with custody, healthcare, and facility operations staff as well as the division of Community Supervision. Other divisions include Administration, Compliance & Accreditation, Comprehensive HealthServices, Internal Affairs & Intelligence Operations, Post-Release Supervision & Parole Commission, and Rehabilitation &Reentry. The Division of Education Services provides a wide range of services to offenders in every state-run facility. Services include basic education, high school equivalency preparation, life skills, career, vocational, and postsecondary degree programs. Education Services focuses on programs of study that provide a certification or degree of some sort, preferably with state or national certification. Education Services has established partnerships with more than two-thirds of the state’s community colleges, as well as with many post-secondary institutions including the University of North Carolina system as well as some private colleges. Funding for education in prisons is provided through varied sources, including non-profit foundation grants, donations from individuals, Federal Second Chance Pell grants, and the General Assembly. The North Carolina Department of Adult Correction (DAC) is an Equal Opportunity Employer who embraces an Employment First philosophy which consists of complying with all federal laws, state laws and Executive Orders.  We are committed to reviewing requests for reasonable accommodation at any time during the hiring process or while on the job. DAC uses the Merit-Based Recruitment and Selection Plan to fill positions subject to the State Human Resources Act with the most qualified individuals. Hiring salary will be based on relevant qualifications, internal equity and budgetary considerations pertinent to the advertised position. It is critical to our screening and salary determination process that applications contain comprehensive information.  Information should be provided in the appropriate areas to include the beginning and ending dates of jobs worked, education with the date graduated, all work experience, and certificates / licenses.  Resumes will not be accepted in lieu of completing this application. Answers to Supplemental Questions must refer to education or work experience listed on this application to receive credit. Degrees must be received from appropriately accredited institutions. Applicants seeking Veteran's Preference must attach a DD-214 Member-4 Form (Certificate of Release or Discharge from Active Duty) to their applications. Applicants seeking National Guard Preference must attach a NGB 23A (RPAS) if they are a current member of the NC National Guard in good standing.  If a former member of the NC National Guard who served for at least 6 years and was discharged under honorable conditions, they must attach either a DD256 or NGB 22. If applicants earned college credit hours but did not complete a degree program, they must attach an unofficial transcript to each application to receive credit for this education. If applying for a position certified through the NC Dept. of Justice - Criminal Justice Standards Division, click this link for specific certification requirements:  Correctional & Probation/Parole Officer Certification. The NC Dept. of Adult Correction must adhere to the US Dept. of Justice Final Rule on the 'National Standards to Prevent, Detect, and Respond to Prison Rape.'  Click this link for information on hiring and promotion prohibition requirements for all positions in the NC Dept. of Adult Correction: PREA Hiring and Promotion Prohibitions (Download PDF reader)(Download PDF reader)(Download PDF reader)(Download PDF reader)(Download PDF reader)(Download PDF reader) Download PDF reader) (Download PDF reader). Due to the volume of applications received, we are unable to provide information regarding the status of your application over the phone. To check the status of your application, please log in to your account and click 'Application Status.' If you are selected for an interview, you will be contacted by management. If you are no longer under consideration, you will receive an email notification. For technical issues with your application, please call the GovernmentJobs.com Applicant Support Help- Line at 855-524-5627. If there are any questions about this posting other than your application status, please contact Monica Malone atmonica.malone@dac.nc.gov",
    "Description of Work Are you a Registered Nurse (RN) looking for a rewarding role where you can make a difference every day? Join the NC Department of Adult Correction, where you’ll play a vital role in delivering essential health services to the offender population in a structured and collaborative healthcare setting.  If you’re a detail-oriented and dedicated Registered Nurse (RN) ready to take the next step in your healthcare career, apply today! This is your opportunity to gain valuable experience, develop your skills, and make a positive impact every day. The NC Department of Adult Correction continuously recruits for Temporary Registered Nurse positions and will accept applications regardless of whether there is a current vacancy. Your application for this posting will remain on file for 365 days and will be screened for vacancies as they occur. What You’ll Do: Providing professional nursing care/treatment to patients in accordance with medical protocols, written policies and procedures, and the NC Board of Nursing scope of practice Work includes conducting sick call/assessment, assisting the physician, carrying out orders, planning, implementing and evaluating nursing care Position responds to medical emergencies Monitors for communicable diseases Counsels for compliance with diet, medications and treatment Responds to inquiries, medical appointments, orders medications and supplies, and additional nursing care duties, as required Position requires oversight of LPN and CNA I/II staff, as designated by management Why Join Us? Professional Growth: Expand your skills in medication administration and healthcare delivery Impactful Work: Contribute to improving the health and well-being of individuals who need it most Flexible Opportunities: Statewide openings with a variety of shift schedules to fit your availability Collaborative Environment: Work alongside experienced healthcare professionals who value teamwork and patient care Position Details: Temporary Role: 11-month position with a 31-day break; renewable upon successful completion of the contract Location: Statewide – Work location and shift assignment to be agreed upon during the hiring process. Requirements: Applicants must pass a background check to be eligible for this position Knowledge, Skills and Abilities / Competencies The Knowledge, Skills and Abilities listed below, along with the Minimum Education and Experience requirements, are REQUIRED to qualify for this position. We will not review resumes in lieu of Experience and Education listed on the application. To qualify for this position, applicants must document on the application that they possess ALL of the following: Demonstrated knowledge of basic nursing principles and techniques to include physical assessments, clinical judgments, treatment planning and evaluation Minimum Education and Experience Requirements Some state job postings say you can qualify by an 'equivalent combination of education and experience.' If that language appears below, then you may qualify through EITHER years of education OR years of directly related experience, OR a combination of both. See https://oshr.nc.gov/experience-guide for details. Licensed to practice as a Registered Nurse in the State of North Carolina Note: Must be licensed to practice as a Registered Nurse in the State of North Carolina. If possessing a single state RN license from a state other than North Carolina, MUST apply and receive at a minimum a 'Temporary License' to practice in NC prior to hire date. Supplemental and Contact Information DAC.jpg The Department of Adult Correction is one of the largest state agencies with more than 19,000 employees. It is responsible for safeguarding and preserving the lives and property of its citizens through prevention, protection, and preparation as well as the care, custody, and supervision of all adults sentenced after conviction for violating North Carolina laws. This department includes State Prisons with custody, healthcare, and facility operations staff as well as the division of Community Supervision. Other divisions include Administration, Compliance & Accreditation, Comprehensive Health Services, Internal Affairs & Intelligence Operations, Post-Release Supervision & Parole Commission, and Rehabilitation & Reentry. The Division of Comprehensive Health Services is dedicated to providing evidence-based, compassionate, and constitutionally consistent medical care to all offenders in custody. Their goal is to ensure that all offenders receive full-spectrum medical care from the time of entry until their release. The team of physicians, nurses, behavioral health services, dental services, psychiatric services, pharmacy services, and licensed healthcare administration services work together to provide emergent, acute, routine, and chronic health care, as well as preventive medicine at all prison facilities. They also coordinate with specialists and other clinical consultants outside of prisons throughout the state to ensure comprehensive health and well-being towards a safe transition from prison, improving public health, and decreasing recidivism. The North Carolina Department of Adult Correction (DAC) is an Equal Opportunity Employer that embraces an Employment First philosophy which consists of complying with all federal laws, state laws, and Executive Orders. We are committed to reviewing requests for reasonable accommodation at any time during the hiring process or while on the job. DAC uses the Merit-Based Recruitment and Selection Plan to fill positions subject to the State Human Resources Act with the most qualified individuals. Hiring salary will be based on relevant qualifications, internal equity, and budgetary considerations pertinent to the advertised position. It is critical to our screening and salary determination process that applications contain comprehensive information. Information should be provided in the appropriate areas to include the beginning and ending dates of jobs worked, education with the date graduated, all work experience, and certificates/licenses. Resumes will not be accepted in lieu of completing this application. Answers to Supplemental Questions must refer to the education or work experience listed on this application to receive credit. Degrees must be received from appropriately accredited institutions. Applicants seeking Veteran's Preference must attach a DD-214 Member-4 Form (Certificate of Release or Discharge from Active Duty) to their applications Applicants seeking National Guard Preference must attach a NGB 23A (RPAS) if they are a current member of the NC National Guard in good standing. If a former member of the NC National Guard who served for at least 6 years and was discharged under honorable conditions, they must attach either a DD256 or NGB 22 If applicants earned college credit hours but did not complete a degree program, they must attach an unofficial transcript to each application to receive credit for this education The NC Dept. of Adult Correction must adhere to the US Dept. of Justice Final Rule on the 'National Standards to Prevent, Detect, and Respond to Prison Rape.' Click this link for information on hiring and promotion prohibition requirements for all positions in the NC Dept. of Adult Correction: PREA Hiring and Promotion Prohibitions (Download PDF reader) (Download PDF reader) If you were ever charged with a criminal offense at some point in your life, you may be required to provide certified and true copies of warrant(s) and judgment(s) for each offense (other than a minor traffic violation) as a condition of employment, even if documentation and charges have previously been reported to this agency By providing the requested information, you certify that you have given true, accurate and complete information on this attachment to the best of your knowledge. In the event confirmation is needed in connection with your work, you authorize educational institutions, associations, registration and licensing boards, and others to furnish whatever detail is available concerning your qualifications. You authorize investigation of all statements made in this application and understand that false information or documentation, or a failure to disclose relevant information may be grounds for rejection of your application, disciplinary action or dismissal if you are employed, and(or) criminal action. You further understand that dismissal upon employment shall be mandatory if fraudulent disclosures are given to meet position qualifications (Authority: GS 126-30, GS 14-122.1). Due to the volume of applications received, we are unable to provide information regarding the status of your application over the phone. To check the status of your application, please log in to your account and click 'Application Status.' If you are selected for an interview, you will be contacted by management. If you are no longer under consideration, you will receive an email notification. For technical issues with your application, please call the GovernmentJobs.com Applicant Support Help Line at 855-524-5627. If there are any questions about this posting other than your application status, please contact Kelly Killough at kelly.killough@dac.nc.gov or (984)-389-7838.",
    "Description of Work The North Carolina Department of Revenue is recruiting for an Accountant I in the Budget Services Unit of our Financial Services Division. The Division’s primary purpose is to support the Department of Revenue’s mission of funding public services benefiting the people of North Carolina, through the administration of tax laws and collection of taxes due in an impartial, consistent, secure, and efficient manner. This position reports directly to the Budget Services Manager and its primary purpose is to accurately and timely record the agency’s daily tax deposits, into the State’s accounting system. This requires attention to detail and an understanding of accounting rules and principles as well as the departmental accounting structure. This position is also responsible for the monthly reimbursement billings to other State agencies which requires the analysis of multiple budget reports and the extraction of specific data from those reports. As part of reviewing and maintaining Departmental internal controls, this position reviews and approves the bi-weekly accounts payable pre-payment report and is responsible for completing the annual EAGLE Internal Controls risk assessment and review. This position works closely with management at year-end for the Annual Comprehensive Financial Report (ACFR) accrual reporting, is the designated person responsible for maintaining the fixed asset system to ensure completeness and accuracy of assets reported in the fixed asset system and serves as the primary backup to other positions within Budget Services. COMPENSATION & BENEFITS: The state of North Carolina offers excellent comprehensive benefits. Employees can participate in health insurance options, standard and supplemental retirement plans, and the NCFlex program (numerous high-quality, low-cost benefits on a pre-tax basis). Some highlights include: • 12 paid holidays per year • 14 vacation days per year which increase as length of service increases and accumulates year-to-year • 12 sick days/year which are cumulative indefinitely • Paid Parental Leave • Paid Personal Observance Leave and Community Service Leave • Longevity pays lump sum payout yearly based on length of service • The best funded pension plan/retirement system in the nation according to Moody's Investor's Service • 401K, 457, and 403(b) plans • Eligibility for the Public Service Loan Forgiveness Program • Eligibility for Academic Assistance Knowledge, Skills and Abilities / Competencies Considerable knowledge of accounting methods, procedures, and accounting practices General knowledge of a variety of technology, financial systems, and software packages to create and maintain data Ability to interpret and apply common to moderately complex Federal and State fiscal regulations Demonstrated ability to analyze and correct financial problems and accounting errors and make minor adjustments to the accounting system and procedures Ability to prepare interpretive or analytical Accounting or financial reports Management Preference: Candidate with considerable work experience in Excel Minimum Education and Experience Requirements Some state job postings say you can qualify by an “equivalent combination of education and experience.” If that language appears below, then you may qualify through EITHER years of education OR years of directly related experience, OR a combination of both. See oshr.nc.gov/experience-guide for details. Bachelor’s degree in Accounting, Business Administration, Finance, Public Administration, or a related discipline from an appropriately accredited institution with 18 semester hours of accounting; or equivalent combination of education and experience. Supplemental and Contact Information The North Carolina Department of Revenue is committed to excellence in tax administration, ensuring secure and efficient collection of revenue to fund vital public services. We are an employer of choice offering excellent benefits, competitive pay, professional development, and career advancement. Our dedicated team provides accurate information, achieves high compliance, and delivers innovative services with integrity and fairness. DOR is an equal opportunity employer hiring qualified candidates regardless of race, color, gender, national origin, religion, age, disability, or political affiliation. The Department of Revenue seeks to fill positions with the most qualified individuals in its effort to provide taxpayers with the most efficient and effective services possible. This position is subject to federal and state criminal background checks that may include fingerprinting and verification of tax compliance. 'Tax compliance' is defined as having filed and paid all North Carolina State taxes owed each year leading up to the current calendar year or currently in a non-delinquent payment status with the State of North Carolina on taxes that are currently owed to the state. To be considered within the most qualified pool of applicants and receive credit for your work history and credentials, you must document all related education and experience on the State of North Carolina application in the appropriate sections of the application form. Any information omitted from the application cannot be considered for qualifying credit. NC DOR welcomes attached resumes, cover letters and reference information, but these items will not be used for screening for qualifying credit. Please make sure the application is completed in full. 'See Resume' or 'See Attachment' will NOT be accepted. Applicants eligible for veteran's preference should attach a copy of form DD-214. If you are having technical issues logging into your account or applying for a position, please review the Get Help/FAQ's information on the website. If you are still experiencing technical issues with your application, please call the NeoGov Help Line at 855-524-5627. If you have general questions about the application process, you may contact Human Resources at 919-814-1200 orHumanResources@ncdor.gov. Individuals with disabilities requiring disability-related accommodations in the interview process, please call the agency ADA Administrator at 919-605-6074.",
    "Description of Work Reporting to the Administrative Officer II, this position will ensure the accuracy and fiscal policy compliance with critical Accounting duties and is primarily responsible for Trust Fund Accounting, Offender Welfare Accounting, Monthly Canteen Reporting for all the canteens, and will serve as a back-up for the Fiscal Accounting Technician. Job responsibilities include, but are not limited to, the following: Reviewing, interpreting, and applying current policy and procedure to applicable purchasing, accounts payable, and other accounting procedures. Analyzing data for accuracy, researching and problem-solving. Accurately operating a personal computer, mainframe terminal, calculator, copy machine, facsimile machine, and other communication equipment. Managing spreadsheets and maintaining logs of various documents and forms. This is a full-time position (40 hours per week) with State Benefits. Note to Current State Employees: State employees are encouraged to apply for positions of interest even if the salary grade is the same as, or lower than, their current position.  If selected for this position, a new salary will be recalculated taking into consideration the quantity of relevant education and experience, funding availability, and internal equity.  Based upon these factors, a pay increase MAY result. About Columbus Correctional Institution: Columbus Correctional Institution is located in Whiteville, North Carolina and houses up to 698 male offenders in a medium custody facility. Knowledge, Skills and Abilities / Competencies Effective July 01, 2025, candidates now meet the minimum qualifications of a position if they have the minimum education and experience listed from the class specification. The knowledge, skills, and abilities listed in the vacancy announcement should be used as management preferences and be used to screen for the most qualified pool of applicants. Management Preferences: Knowledge of Accounting methods, procedures, and practices Experience using Microsoft Excel Experience using Microsoft Word Minimum Education and Experience Requirements Some state job postings say you can qualify by an “equivalent combination of education and experience.” If that language appears below, then you may qualify through EITHER years of education OR years of directly related experience, OR a combination of both. See https://oshr.nc.gov/experience-guide for details. Associate's degree in accounting from an appropriately accredited institution Or High school or General Educational Development (GED) diploma and two years of experience in accounting work Or An equivalent combination of education and experience. Supplemental and Contact Information Accounting Technician I description image Come Join Us To Make A Difference! Department of Adult Correction is one of the largest state agencies with more than 19,000 employees. It is responsible for safeguarding and preserving the lives and property of its citizens through prevention, protection, and preparation as well as the care, custody, and supervision of all adults sentenced after conviction for violating North Carolina laws. This department includes State Prisons with custody, healthcare, and facility operations staff as well as the division of Community Supervision. Other divisions include Administration, Compliance and Accreditation, Comprehensive Health Services, Internal Affairs and Intelligence Operations, Post-Release Supervision and Parole Commission, and Rehabilitation & Reentry. The Division of Institutions employs over 19,000 staff, operates 56 institutions and is responsible for the care and custody of approximately 30,000 incarcerated individuals across North Carolina. Our division categorizes the institutions into 3 custody levels, which include minimum, medium, and close.  The Division of Institutions has a duty to provide a secure and safe environment along with the proper care and supervision for every individual, in our custody. The North Carolina Department of Adult Correction (DAC) is an Equal Opportunity Employer who embraces an Employment First philosophy which consists of complying with all federal laws, state laws and Executive Orders. We are committed to reviewing requests for reasonable accommodation at any time during the hiring process or while on the job. DAC uses the Merit-Based Recruitment and Selection Plan to fill positions subject to the State Human Resources Act with the most qualified individuals.  Hiring salary will be based on relevant qualifications, internal equity, and budgetary considerations pertinent to the advertised position. It is critical to our screening and salary determination process that applications contain comprehensive information. Information should be provided in the appropriate areas to include the beginning and ending dates of jobs worked, education with the date graduated, all work experience, and certificates / licenses.  Resumes will not be accepted in lieu of completing this application. Answers to Supplemental Questions must refer to the education or work experience listed on this application to receive credit. Degrees must be received from appropriately accredited institutions. Applicants seeking Veteran's Preference must attach a DD-214 Member-4 Form (Certificate of Release or Discharge from Active Duty) to their applications. Applicants seeking National Guard Preference must attach a NGB 23A (RPAS) if they are a current member of the NC National Guard in good standing.  If a former member of the NC National Guard who served for at least 6 years and was discharged under honorable conditions, they must attach either a DD256 or NGB 22. If applicants earned college credit hours but did not complete a degree program, they must attach an unofficial transcript to each application to receive credit for this education. If applying for a position certified through the NC Dept. of Justice - Criminal Justice Standards Division, click this link for specific certification requirements:  Correctional & Probation/Parole Officer Certification. The NC Dept. of Adult Correction must adhere to the US Dept. of Justice Final Rule on the 'National Standards to Prevent, Detect, and Respond to Prison Rape.'  Click this link for information on hiring and promotion prohibition requirements for all positions in the NC Dept. of Adult Correction: PREA Hiring and Promotion Prohibitions (Download PDF reader). Per NC General Statute 143B-972.1 (Download PDF reader), applicants hired into a position certified as a criminal justice officer or justice officer are required to electronically submit fingerprints to the NC State Bureau of Investigation for a state and national criminal history record check and enrollment in the FBI’s Next Generation Identification System: Criminal Justice Record of Arrest and Prosecution Background Service (“RAP Back”).  This is in addition to submitting fingerprints during the application process. If you were ever charged with a criminal offense at some point in your life, you will be required to provide certified and true copies of warrant(s) and judgment(s) for each offense (other than a minor traffic violation) as a condition of employment, even if documentation and charges have previously been reported to this agency. Due to the volume of applications received, we are unable to provide information regarding the status of your application over the phone. To check the status of your application, please log in to your account and click 'Application Status.'  If you are selected for an interview, you will be contacted by management.  If you are no longer under consideration, you will receive an email notification. For technical issues with your application, please call the GovernmentJobs.com Applicant Support Help Line at 855-524-5627. If there are any questions about this posting other than your application status, please contact Lyndsey Schrier at (910) 944-2359."
]