[
    "Description of Work Assistant District Attorney description imageSALARY GRADE:  Flat Rated The Office of the District Attorney, Prosecutorial District 15, seeks a qualified attorney to prosecute criminal cases. Duties include but are not limited to the following: screen incoming cases using logic and reasoning to identify the strengths and weaknesses of case facts; research and identify precedence in case law; utilize and evaluate electronic legal research and other research tools; prepare cases for trial; write and file any appropriate motions; organize work; set priorities; meet critical deadlines; follow up on assignments; and meet with victims of crime. Caseload may include district and superior court cases. Knowledge, Skills and Abilities / Competencies Knowledge of: federal, state, common, and constitutional law; judicial procedures and rules of evidence; case, statutory, and common law; NC General Statutes to prosecute criminal cases; judicial and quasi-judicial procedures; legal research methods, techniques, sources, databases, and other research tools; the principles and protocols for the evidentiary gathering of information, documents, financial records, and other data that may be used in trial court processes, protocols, and strategies; the operations of the NC court system; and ethical and professional standards of conduct. Skill in: interpreting and applying complex criminal laws to information, evidence, and other data; listening techniques used in interviewing witnesses; using logic and reasoning to identify the strengths and weaknesses of case facts; researching and identifying precedence in case law; utilizing and evaluating electronic legal research and online systems; negotiating plea agreements; organizing work; setting priorities; meeting critical deadlines; and following up on assignments with a minimum of direction. Ability to: analyze facts, laws, rules, regulations, interpretations, and related written documents and apply applicable law to those facts; conduct legal research; plan, develop, and execute an effective litigation strategy to achieve desired results; prepare, organize, and conduct witness examinations; deliver opening statements, closing arguments, and evidentiary objections; express complex legal concepts and related facts in a clear and concise manner; argue clearly, logically, and persuasively; establish and maintain cooperative working relationships with attorneys, law enforcement agencies, and other participants in the criminal justice process; recognize and solve problems; produce legal interpretations in a quick and responsive manner for court officials; write reports, motions, briefs, and other legal documents; deal tactfully with sensitive situations; communicate both orally and in writing; and work independently. Minimum Education and Experience Requirements Juris Doctor degree from an ABA accredited law school and an active license to practice law in North Carolina. Attach cover letter and résumé. Supplemental and Contact Information INSTRUCTIONS: Applicants must complete an on-line application by clicking the above APPLY link. Mailed or faxed applications will not be accepted. Before applying, please read the Online Employment Application Guide for instructions on creating your profile and applying for specific postings. It is important your application includes all of your relevant education and work experience and that you answer all questions associated with the application to receive proper credit. Résumés are not accepted in lieu of fully completed applications. *NOTE* Many job postings require certain documents be attached to an application. Verify your application is complete and uploaded documents are attached to your application before submitting it. Applications may not be altered after they have been submitted. Carefully review the FAQs if you experience difficulty with the application process or attaching documents. For technical issues with applications or attachments, call the NeoGov Help Line at 855-524-5627. Assistant District Attorney description image All NC Judicial Branch agencies are Equal Opportunity Employers. The North Carolina Judicial Branch participates in E-Verify, an internet-based system that compares information from an employee's Form I-9, Employment Eligibility Verification, to data from the US Department of Homeland Security and Social Security Administration records to confirm employment eligibility. To learn more, click on these links: E-Verify  (Download PDF reader)Participation (Download PDF reader) E-Verify (Download PDF reader) Participation (Spanish) (Download PDF reader) Right to  (Download PDF reader)Work (Download PDF reader) Right (Download PDF reader) to Work (Spanish) (Download PDF reader) Charmaine J. Leeks NC Administrative Office of the Courts Human Resources Division https://www.nccourts.gov/about/about-judicial-branch/careers"
]